from enum import Enum

class Opcodes(Enum):
    ADD = 0
    SUB = 1
    MUL = 2
    DIV = 3
    MOD = 4
    INC = 5
    DEC = 6
    PUSH = 7
    POP = 8
    IN = 9
    OUT = 10
    LOAD = 11 # в регистр
    STORE = 12 # в память
    JUMP = 13
    JUMPZ = 14
    JUMPNZ = 15
    HALT = 16


'''
Опкод | тип адресации 2 операнда | 1 операнд | 2 операнд
00000|0|0000|0000000000000000000000 - 32 бита

Опкод: нумерация как в классе Opcodes
Тип адресации 2 операнда: 0 - регистр, 1 - непосредственная
1 операнд - номер регистра
2 операнд - номер регистра, либо операнд
'''

